# Recap
- pandas
    - `import pandas as pd`
    - `pd.DataFrame()`
        - index
        - columns
        - loc, iloc
        - merge, concat
        - apply
        - groupby
- matplotlib
    - `import matplotlib.pyplot as plt`
    - `plt.plot()`
        - line plot
        - bar plot
        - hist plot
        - scatter plot
        - groupby plot

# Data Analytics Basics 2
- Database : 데이터를 저장해두는 툴. 데이터를 관리하는데 있어서 굉장히 편리하다.
    - 정형화된 데이터 : postgresql
    - 비정형화된 데이터 : NoSQL

</n>

## 관계형 데이터베이스
- 종류 : MySQL, PostgreSQL, SQLserver, MariaDB
- 구조 : Schema (데이터를 기본적을 저장하는 구조)
- table 저장해두는 테이블
- 명령어
    - select, from, where
- 파이썬을 이용해 데이터베이스 연결 및 테이블 생성 및 데이터 연동
    - SQLAlchemy와 pandas를 이용
    - 설치 방법 :
        - `$ pip install sqlalchemy psycopg2`
    - DB 연동
        - `create_engine("postgresql+psycopg2://username:password@hostname:portnumber/databasename")`
        - `pd.read_sql(query, cone=engine)`

In [1]:
from sqlalchemy import create_engine
import pandas as pd
import psycopg2

with create_engine("postgresql+psycopg2://postgres@localhost:5432", isolation_level="AUTOCOMMIT").connect() as connection :
    connection.execute("CREATE DATABASE mydb")

ProgrammingError: (psycopg2.errors.DuplicateDatabase) 오류:  "mydb" 이름의 데이터베이스는 이미 있음

[SQL: CREATE DATABASE mydb]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [2]:
raw_data = {'first_name': ['Peter', 'Smith', 'Leo', 'Hagrid', 'Arnold'],
            'last_name': ['Parker', 'Black', 'Tinid', 'Boswitz', 'Tucker'],
            'age': [23, 31, 33, 31, 25],
            'class' : ["A", "A", "B", "B", "C"],
            'test_score': [100, 78, 89, 84, 43],
            'hight': [179, 182, 168, 172, 180]}

df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'class',
                                       'test_score', 'hight'])
df

  first_name last_name  age class  test_score  hight
0      Peter    Parker   23     A         100    179
1      Smith     Black   31     A          78    182
2        Leo     Tinid   33     B          89    168
3     Hagrid   Boswitz   31     B          84    172
4     Arnold    Tucker   25     C          43    180

In [3]:
engine = create_engine("postgresql+psycopg2://postgres@localhost:5432/mydb")

In [5]:
df.to_sql("mytable", con=engine, if_exists="replace")

5

## Query를 통해 데이터를 불러와보자
- 기본 명령문
    - ```
    select 
    from
    ```

In [6]:
query = """
select first_name, last_name
from mytable
"""

In [8]:
df = pd.read_sql_query(query, con=engine)

In [10]:
df

  first_name last_name
0      Peter    Parker
1      Smith     Black
2        Leo     Tinid
3     Hagrid   Boswitz
4     Arnold    Tucker

In [11]:
def load_data_from_database(query, connection):
    return pd.read_sql_query(query, con=connection)

In [12]:
query = """
select first_name
from mytable
where age > 30
"""

load_data_from_database(query, engine)

  first_name
0      Smith
1        Leo
2     Hagrid

## group by
- pandas에서도 하듯 groupby를 할 수 있음
- 집계함수
    - AVG : 평균
    - COUNT : 개수
    - SUM : 합
    - MIN, MAX : 최소, 최대

In [14]:
query = """
SELECT max(hight) as maximum
FROM mytable
GROUP BY class
"""

load_data_from_database(query, engine)

   maximum
0      172
1      180
2      182

## 새로운 데이터 추가

In [15]:
raw_data = {'first_name': ['Sam', 'Bul', 'Lark'],
            'last_name': ['Miles', 'Kirk', 'Pinoza'],
            'age': [33, 31, 25],
            'class' : ["A", "B","C"],
            'test_score': [100, 84, 43],
            'hight': [179, 182, 180]}

df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'class',
                                       'test_score', 'hight'])
df

  first_name last_name  age class  test_score  hight
0        Sam     Miles   33     A         100    179
1        Bul      Kirk   31     B          84    182
2       Lark    Pinoza   25     C          43    180

In [16]:
df.to_sql('mytable', if_exists='append', con=engine)

3

In [17]:
load_data_from_database('select * from mytable', engine)

   index first_name last_name  age class  test_score  hight
0      0      Peter    Parker   23     A         100    179
1      1      Smith     Black   31     A          78    182
2      2        Leo     Tinid   33     B          89    168
3      3     Hagrid   Boswitz   31     B          84    172
4      4     Arnold    Tucker   25     C          43    180
5      0        Sam     Miles   33     A         100    179
6      1        Bul      Kirk   31     B          84    182
7      2       Lark    Pinoza   25     C          43    180

## 새로운 테이블 만들기
- `CREATE TABLE`과 함께 변수들과 변수들에 해당하는 데이터 타입을 정해줘야 함

In [18]:
new_table = {'first_name': ['Peter', 'Peter', 'Peter'],
            'last_name': ['Parker', 'Parker', 'Parker'],
            'sequence': [0, 1, 2],
            'result' : ["A", "B","A"],
            }

df = pd.DataFrame(new_table, columns = ['first_name', 'last_name', 'sequence', 'result'])
                                       
df

  first_name last_name  sequence result
0      Peter    Parker         0      A
1      Peter    Parker         1      B
2      Peter    Parker         2      A

In [19]:
df.to_sql("new_table", if_exists='replace', con=engine)

3

## Join
- left join, right join

In [20]:
query = """
select *
from new_table
"""

load_data_from_database(query, connection=engine)

   index first_name last_name  sequence result
0      0      Peter    Parker         0      A
1      1      Peter    Parker         1      B
2      2      Peter    Parker         2      A

In [23]:
query = '''

select mt.first_name, mt.last_name, mt.age, mt.class, nt.result
from mytable as mt
join new_table as nt
on mt.first_name=nt.first_name

'''

load_data_from_database(query, engine)

  first_name last_name  age class result
0      Peter    Parker   23     A      A
1      Peter    Parker   23     A      B
2      Peter    Parker   23     A      A